using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace BarTask
{
   // ====Хидтрик==== (Имя заданое пользователем)
//20.12.2024 //Дата заданная пользователем

//====Бегемот==== (Наименование первого заведения)
//Общий счёт: 2500 (Сумма общего счёта)
//Кто закрыл: Женя (Имя друга оплатившего счёт)
//1. Женя 1000 (Имя друга, сумма)
//2. Иван 1000
//3. Саша 500
//===============

//====Соль====
//Общий счёт: 2700 (Сумма общего счёта)
//Кто закрыл: Иван (Имя друга оплатившего счёт)
//1. Женя 1200 (Имя друга, сумма)
//2. Иван 1500
//============

//===Расчёт===
//Саша => 500 => Женя (Кто должен, сумма, кому должен)
//Женя => 200 => Иван



}
